src/cf/InformationRegisters/ЦеныНоменклатурыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыКонтрагентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидЦенКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СпособыРасчетаЦеныНабора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаЦеныНабора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкладыватьИзЦенКомплектующих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначаетсяИРаспределяетсяПоЦене</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначаетсяИРаспределяетсяПоДолеСтоимости</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ЦеныНоменклатурыКонтрагентов/Forms/ФормаДляНоменклатуры/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") 
		И Параметры.Отбор.Свойство("Номенклатура") Тогда
		
		ОтборНоменклатура = Параметры.Отбор.Номенклатура;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,			"Номенклатура", ОтборНоменклатура, ВидСравненияКомпоновкиДанных.Равно, "Номенклатура", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокИстория,	"Номенклатура", ОтборНоменклатура, ВидСравненияКомпоновкиДанных.Равно, "Номенклатура", Истина);
		
		Если (ОтборНоменклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас)
			И (ОтборНоменклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.ПодарочныйСертификат)
			И (ОтборНоменклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга)
			И (ОтборНоменклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Работа)
			Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Цены контрагентов можно вводить только для номенклатуры с типами Запас, Услуга, Работа, Сертификат'");
			
			Элементы.Список.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
		ИнформацияОМинимальнойЦене();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Наборы
	Если НЕ Элементы.Список.ТолькоПросмотр И ТипЗнч(ВладелецФормы)=Тип("УправляемаяФорма") И ВладелецФормы.ИмяФормы="Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		ОбъектНоменклатура = ВладелецФормы.Объект;
		
		Если ОбъектНоменклатура.ЭтоНабор И ОбъектНоменклатура.СпособРасчетаЦеныНабора=ПредопределенноеЗначение("Перечисление.СпособыРасчетаЦеныНабора.СкладыватьИзЦенКомплектующих") Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Цены контрагентов недоступны для наборов со способом расчета цен по комплектующим'");
			Элементы.Список.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	// Конец Наборы
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьИнформациюОМинимальнойЦене(Команда)
	
	ИнформацияОМинимальнойЦене();
	
КонецПроцедуры

&НаКлиенте
Процедура Хронология(Команда)
	
	СоответствиеСтраниц = Новый Соответствие;
	СоответствиеСтраниц.Вставить(Элементы.СтраницаСписок, Элементы.СтраницаСписокИстория);
	СоответствиеСтраниц.Вставить(Элементы.СтраницаСписокИстория, Элементы.СтраницаСписок);
	
	Элементы.Страницы.ТекущаяСтраница = СоответствиеСтраниц.Получить(Элементы.Страницы.ТекущаяСтраница);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнформацияОМинимальнойЦене()
	
	Если НЕ ЗначениеЗаполнено(ОтборНоменклатура) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбновитьИнформациюОМинимальнойЦене", "Видимость", Ложь);
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОтборНоменклатура", ОтборНоменклатура);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦеныКонтрагентов.ВидЦенКонтрагента КАК ВидЦенКонтрагента,
	|	ЦеныКонтрагентов.Период КАК Период,
	|	ЦеныКонтрагентов.Характеристика КАК ХарактеристикаНоменклатуры,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ЦеныКонтрагентов.ВидЦенКонтрагента.ВалютаЦены = НациональнаяВалюта.Значение
	|				ТОГДА ЦеныКонтрагентов.Цена
	|			ИНАЧЕ ЦеныКонтрагентов.Цена * КурсВалютыВидЦен.Курс / КурсВалютыВидЦен.Кратность
	|		КОНЕЦ) КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(, Номенклатура = &ОтборНоменклатура) КАК ЦеныКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсВалютыВидЦен
	|		ПО ЦеныКонтрагентов.ВидЦенКонтрагента.ВалютаЦены = КурсВалютыВидЦен.Валюта,
	|	Константа.НациональнаяВалюта КАК НациональнаяВалюта
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныКонтрагентов.ВидЦенКонтрагента,
	|	ЦеныКонтрагентов.Период,
	|	ЦеныКонтрагентов.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Цена";
	
	РезультатЗапроса = Запрос.Выполнить();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбновитьИнформациюОМинимальнойЦене", "Видимость", НЕ РезультатЗапроса.Пустой());
	
	Если Элементы.ОбновитьИнформациюОМинимальнойЦене.Видимость Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			
			Тело = НСтр("ru ='Минимальная цена <b>%1</b> зарегистрирована <b>%2</b> и составляет <b>%3</b> руб. %4'");
			Параметр1 = Строка(Выборка.ВидЦенКонтрагента);
			Параметр2 = Формат(Выборка.Период, "ДФ=dd.MM.yy");
			Параметр3 = Формат(Выборка.Цена, "ЧДЦ=2; ЧРГ=,; ЧН=0,00; ЧГ=0");
			
			Если ЗначениеЗаполнено(Выборка.ХарактеристикаНоменклатуры) Тогда
				
				Параметр4 = СтрШаблон(НСтр("ru ='(хар-ка:%1)'"), Строка(Выборка.ХарактеристикаНоменклатуры));
				
			Иначе
				
				Параметр4 = "";
				
			КонецЕсли;
			
			СтрокаЗаголовка = СокрЛП(СтрШаблон(Тело, Параметр1, Параметр2, Параметр3, Параметр4));
			
			Элементы.ОбновитьИнформациюОМинимальнойЦенеРасширеннаяПодсказка.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(СтрокаЗаголовка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
